-- 1. Запит для отримання назв книг, які були видані в Києві
SELECT Книги.Назва
FROM Книги
JOIN Книги_Видавництва ON Книги.КнигаID = Книги_Видавництва.КнигаID
JOIN Видавництва ON Книги_Видавництва.ВидавництвоID = Видавництва.ВидавництвоID
WHERE Видавництва.Адреса LIKE '%Київ%';

-- 2. Запит для отримання середньої зарплати працівників за кожною посадою
SELECT Посада, AVG(Зарплата) AS Середня_Зарплата
FROM Працівники
GROUP BY Посада;

-- 3. Запит для отримання назв всіх книг, які були видані в рік народження Лесі Українки
SELECT Назва
FROM Книги
WHERE Рік_видання = (
    SELECT YEAR(Дата_народження)
    FROM Автори
    WHERE "Ім'я" = 'Леся' AND Прізвище = 'Українка'
);

-- 4. Запит для отримання назв книг та їх жанрів, які були видані авторами з прізвищем 'Франко'
SELECT Книги.Назва, Жанри.Назва AS Жанр FROM Книги
JOIN Автори ON Книги.АвторID = Автори.АвторID
JOIN Книги_Жанри ON Книги.КнигаID = Книги_Жанри.КнигаID
JOIN Жанри ON Книги_Жанри.ЖанрID = Жанри.ЖанрID
WHERE Автори.Прізвище = 'Франко';

-- 5. Запит для отримання назв книг, які були видані після 1900 року та належать до жанру 'Фантастика'
SELECT Назва
FROM Книги
WHERE Рік_видання > 1900 AND КнигаID IN (
    SELECT КнигаID
    FROM Книги_Жанри
    WHERE ЖанрID = (
        SELECT ЖанрID
        FROM Жанри
        WHERE Назва = 'Фантастика'
    )
);

-- 6. Запит на додавання рядка до таблиці Автори
INSERT INTO Автори (АвторID, "Ім'я", Прізвище, Дата_народження) VALUES
(17, 'Микола', 'Гоголь', '1809-04-01');

-- 7. Запит на видалення рядка з таблиці Автори
DELETE FROM Автори
WHERE АвторID = 17;

-- 8. Запит для отримання назв всіх книг, які були видані до 1900 року
SELECT Назва
FROM Книги
WHERE Рік_видання < 1900;

-- 9. Запит для отримання імені та прізвища авторів, у яких є книги в жанрі 'Роман'
SELECT "Ім'я", Прізвище
FROM Автори
WHERE АвторID IN (
    SELECT АвторID
    FROM Книги
    WHERE КнигаID IN (
        SELECT КнигаID
        FROM Книги_Жанри
        WHERE ЖанрID = (
            SELECT ЖанрID
            FROM Жанри
            WHERE Назва = 'Роман'
        )
    )
);

-- 10. Запит для отримання назв книг та їх авторів, які не були повернуті читачами
SELECT Книги.Назва, Автори."Ім'я", Автори.Прізвище
FROM Книги
JOIN Автори ON Книги.АвторID = Автори.АвторID
WHERE КнигаID IN (
    SELECT КнигаID
    FROM Видача
    WHERE Дата_повернення IS NULL
);